{
    "id": "badzar2016blockchain",
    "title": "Blockchain for securing sustainable transport contracts and supply chain transparency-An explorative study of blockchain technology in logistics",
    "year": 2016,
    "type": "masterthesis",
    "sortkey": 20160906,
    "authors": [
        {
            "affiliation": "Lund University",
            "name": "Amina Badzar"
        }
    ],
    "peer-reviewed": false,
    "abstract": "Based on the imbalances caused by asymmetric information and opaque supply chains, this study aims to contribute to the research field of logistics and supply chain management by exploring the potential of blockchain technology within logistics. The main focus is on increasing supply chain transparency for both suppliers and consumers, and improving contractual coordination in order to secure fulfilment of sustainability clauses in transportation contracts. The purpose of this paper is to explore the potential application of blockchain in the field of logistics in regard to supply chain transparency and transport contract fulfilment concerning sustainability clauses. The research is conducted through a case study approach, combined with a literature review and a semi-structured interview with an expert with in the field of blockchain technology. The study has the potential to empower the position of consumers, suppliers and manufacturers regarding knowledge about the product and the social and environmental activities associated with the products supply chain. Findings show that the implementation of blockchain in logistics can potentially generate more awareness about the hidden layers of the supply chain, and global transportation. The results could contribute to improving service management within companies and improve their policies concerning sustainability and environmental impacts. The thesis contributes to the expanding research field of blockchain technology within logistics.",
    "url": "http://lup.lub.lu.se/luur/download?func=downloadFile&recordOId=8880383&fileOId=8880390"
}
