{
    "id": "berger2016bitcoin",
    "title": "Bitcoin exchange transactions: income tax implications to consider within the South African environment",
    "year": 2016,
    "type": "masterthesis",
    "authors": [
        {
            "name": "Lynette Louise Berger", "affiliation": "North-West University"
        }
    ],
    "url": "http://dspace.nwu.ac.za/bitstream/handle/10394/17630/Berger_LL_2016.pdf",
    "peer-reviewed": false,
    "abstract": "The use of bitcoins as a medium of exchange is not yet widespread in South Africa, however, it has been noted that this industry is growing at a fast rate as several online retailers are now accepting bitcoins as a means of payment for goods and services, for example Takealot.com. South Africa has already installed its first bitcoin vending machine, situated in Kyalami, north of Johannesburg, to give users the ability to get bitcoins in exchange for rand (Van der Berg, 2015). Also, South Africa’s first digital currency hub was launched on 11 June 2015 to create awareness of the use of bitcoins, educate the community on the benefits of digital currencies and encourage South Africans to participate in the digital currency space (Tiwari, 2015). As more and more South Africans will be introduced and educated in the use and benefits of using digital currencies, the need for proper regulatory and taxation guidance will increase. South African authorities have been silent on how bitcoin transactions should be taxed and even regulated. Research on this matter is relatively limited in South Africa. Studies are thus needed and are relevant to address the South African taxation implications of bitcoin exchange transactions as countries such as Australia and the USA have already issued guidelines to taxpayers in this regard. The first objective of this study was to determine whether bitcoins should be classified as an asset or currency when exchanged for goods, services and real currency. Secondary objectives were identified to assist in addressing this objective, namely: a) A discussion of the characterisation of bitcoins as either property (assets) or currency, by referring to the following: how are the terms ”asset” and ”currency” interpreted from a South African tax perspective and from the perspective of other governments? b) analyse the taxable income consideration on bitcoin exchange transactions in other governments for the following events: i. the receipt of bitcoins in exchange for goods and services (barter transactions); and ii. the sale of bitcoins in exchange for real currency; c) critically analyse the commentary provided by the OECD, Davis Tax Committee and the position expressed by the SARB as to the taxability of bitcoin exchange transactions; and d) make possible recommendations or suggest the most suitable approach on how bitcoin exchange transactions should be taxed in South Africa. The researcher did however not consider whether fluctuations in the value of bitcoins could result in foreign currency gains or losses as envisaged by section 24I of the South African Income Tax Act (Act no. 58 of 1962) and whether such fluctuations could be regarded as interest within the ambit of section 24J. Also not considered in this study are the VAT implications of bitcoin exchange transactions and the impact of any other financial regulatory legislation. However, where relevant in the context, the researcher did briefly elude to the most relevant South African Reserve Bank exchange regulation specifically relevant to currency and anti-money laundering laws. A non-empirical study was performed to understand the current tax position in South Africa, with regards to the classification of bitcoins either as an asset or currency for bitcoin exchange transactions that may result in taxable income. In conclusion, the current South African tax legislation does make provision for the classification of virtual currencies such as bitcoins. Therefore, based on the current taxation legislation and case law discussed in chapter four of this dissertation, virtual currencies, such as bitcoins should be classified as an asset for South African income tax purposes. It is, however, suggested that the South African authorities, such as the South African Revenue Services and the South African Reserve Bank issue appropriate guidelines in the treatment of bitcoin exchange transactions as countries such as Australia and the USA that have already embarked on this much needed guidance for virtual currency users. "
}
