{
    "id": "defilippi2016interplay",
    "title": "The interplay between decentralization and privacy: the case of blockchain technologies",
    "authors": [
	{"name": "Primavera De Filippi", "affiliation": "Berkman Center for Internet & Society at Harvard"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "http://peerproduction.net/wp-content/uploads/2016/08/blockchain-technologies-draft.pdf",
    "abstract": "With the current state of telecommunication technologies, it is becoming harder to communicate on the Internet without leaving traces or disclosing information to centralized third parties –be they either governmental agencies or corporations (Lyon, 2014). Indeed, in spite of its distributed infrastructure, today’s Internet is highly centralized. A large majority of the Internet traffic is routed through a few centralized services, controlled and governed by a few large corporations. Centralized platforms are useful coordination tools, which provide end-users with great comfort and convenience. Yet, they often come at the expense of privacy and individual autonomy, as users delegate to third parties the task of managing their online activities (De Filippi, 2013). Moreover, most centralized platforms rely on unifying network points that can be regarded as single points of failure, to the extent that they are more likely to be attacked by malicious users, or simply be coerced by governmental agencies in order to disclose information about specific users (Schneier, 2009). There is a growing interest in decentralized architectures as a way to protect one’s privacy against the growing authority and surveillance of centralized third parties. Decentralized architectures are much more supportive of individual freedoms, such as privacy and freedom of expression (Ziccardi, 2012). Yet, although less likely to be subject to centralized control, they are much more difficult to implement as effective coordination mechanisms. In particular, decentralized architectures suffer from an important drawback that might ultimately impinge upon users’ privacy: if the price of centralization is trust —since one needs to trust the centralized party to act in compliance with privacy rights— decentralization comes at the costs of transparency —as coordination amongst a distributed network of peers is generally achieved through the disclosure of everyone’s interactions. While decentralized architectures can provide more privacy at the content layer (to the extent that content is properly encrypted), they cannot protect themselves against third parties analysis of metadata, which is openly disclosed to every node connected to the network. Unless additional technological means are employed to protect the privacy of metadata, it might therefore turn out that highly decentralized infrastructures, designed to promote privacy and autonomy, end up 0 being more vulnerable to governmental or corporate scrutiny than their centralized counterparts. This paper will focus specifically on blockchain technologies, as an example of extreme decentralization which “suffers” from radical transparency, and whose privacy-enhancing features might therefore be turned against a decentralized network of users (Bradbury, 2013). Our argument will focus on the novel capacities of data mining techniques, as applied to the analysis blockchain metadata, and how these could be just as invasive as traditional surveillance on centralized platforms. We will then move on to analyse how recent advances in cryptography might potentially resolve the inherent trade-off between privacy and transparency, for the ultimate benefit of end-users.",
    "type": "online",
    "sort-key": 20160928
}
