{
    "id": "dmitrienko2017secure",
    "title": "Secure Wallet-Assisted Offline Bitcoin Payments With Double-Spender Revocation",
    "year": 2017,
    "type": "inproceedings",
    "sortkey": 20170408,
    "authors": [
        {
            "affiliation": "ETH Zurich",
            "name": "Alexandra Dmitrienko"
        },
        {
            "affiliation": "Technische Universität Darmstadt",
            "name": "David Noack"
        },
        {
            "affiliation": "Snapchat, Inc. and Columbia University",
            "name": "Moti Yung"
        }
    ],
    "url": "https://www.ethz.ch/content/dam/ethz/special-interest/infk/inst-infsec/system-security-group-dam/research/publications/pub2017/asia084.pdf",
    "venue": "Asia Conference on Computer and Communications Security",
    "peer-reviewed": true,
    "abstract": "Bitcoin seems to be the most successful cryptocurrency so far given the growing real life deployment and popularity. While Bitcoin requires clients to be online to perform transactions and a certain amount of time to verify them, there are many real life scenarios that demand for offline and immediate payments (e.g., mobile ticketing, vending machines, etc). However, offline payments in Bitcoin raise non-trivial security challenges, as the payee has no means to verify the received coins without having access to the Bitcoin network. Moreover, even online immediate payments are shown to be vulnerable to double-spending attacks. In this paper, we propose the first solution for Bitcoin payments, which enables secure payments with Bitcoin in offline settings and in scenarios where payments need to be immediately accepted. Our approach relies on an offline wallet and deploys several novel security mechanisms to prevent double-spending and to verify the coin validity in offline setting. These mechanisms achieve probabilistic security to guarantee that the attack probability is lower than the desired threshold. We provide a security and risk analysis as well as model security parameters for various adversaries. We further eliminate remaining risks by detection of misbehaving wallets and their revocation. We implemented our solution for mobile Android clients and instantiated an offline wallet using a microSD security card. Our implementation demonstrates that smooth integration over a very prevalent platform (Android) is possible, and that offline and online payments can practically co-exist. We also discuss alternative deployment approach for the of- fline wallet which does not leverage secure hardware, but instead relies on a deposit system managed by the Bitcoin network."
}
