{
    "id": "ekblaw2016case",
    "title": "A Case Study for Blockchain in Healthcare:“MedRec” prototype for electronic health records and medical research data",
    "authors": [
	{"name": "Ariel Ekblaw", "affiliation": "MIT Media Lab"},
	{"name": "Asaph Azaria", "affiliation": "MIT Media Lab"},
	{"name": "John D Halamka", "affiliation": "Beth Israel Deaconess Medical Center"},
	{"name": "Andrew Lippman", "affiliation": "MIT Media Lab"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "https://www.healthit.gov/sites/default/files/5-56-onc_blockchainchallenge_mitwhitepaper.pdf",
    "abstract": "A long-standing focus on compliance has traditionally constrained development of fundamental design changes for Electronic Health Records (EHRs). We now face a critical need for such innovation, as personalization and data science prompt patients to engage in the details of their healthcare and restore agency over their medical data. In this paper, we propose MedRec: a novel, decentralized record management system to handle EHRs, using blockchain technology. Our system gives patients a comprehensive, immutable log and easy access to their medical information across providers and treatment sites. Leveraging unique blockchain properties, MedRec manages authentication, confidentiality, accountability and data sharing—crucial considerations when handling sensitive information. A modular design integrates with providers' existing, local data storage solutions, facilitating interoperability and making our system convenient and adaptable. We incentivize medical stakeholders (researchers, public health authorities, etc.) to participate in the network as blockchain “miners”. This provides them with access to aggregate, anonymized data as mining rewards, in return for sustaining and securing the network via Proof of Work. MedRec thus enables the emergence of data economics, supplying big data to empower researchers while engaging patients and providers in the choice to release metadata. The purpose of this paper is to expose, in preparation for field tests, a working prototype through which we analyze and discuss our approach and the potential for blockchain in health IT and research.",
    "type": "online",
    "sort-key": 20160906
}
