{
    "id": "fawcett2017bitcoin",
    "title": "Bitcoin Regulations And Investigations: A Proposal For Us Policies",
    "year": 2017,
    "type": "phdthesis",
    "sortkey": 20170121,
    "authors": [
        {
            "affiliation": "Utica College",
            "name": "Jay Palmer Fawcett"
        }
    ],
    "url": "http://gradworks.umi.com/10/24/10244196.html",
    "peer-reviewed": false,
    "abstract": "Bitcoins were conceptualized in 2008, which revolutionized the digital transfers of value within payment systems (Nakamoto, 2008). The advent of digital currencies revealed problems concerning anonymity embedded in bitcoins, consequently raising money laundering concerns. Regulators and law enforcement agencies struggle with addressing the money laundering issues inherent with bitcoin and digital currencies (Ajello, 2025). In response to these threats, agencies have issued various opinions regarding defining digital currencies within a financial framework. Regulator opinions concerning the applicability of bitcoins existing as currency, property, a commodity and commodity money contradict each other. Moreover; prosecutorial agencies attempt to fit digital currency exchangers under the regulations pertinent to money service businesses (MSB) (Mandjee, 2015; Sonderegger, 2015). This project provided an analysis of scholarly material, government publications, case law, and current trade information to examine a solution to the problem of money laundering through digital currency. This project revealed a need for a clear definition of bitcoin and digital currency within the context of U.S. laws and regulation to assist with investigations concerning illicit uses of digital currency. Furthermore, a need exists for new U.S. legislation specific to digital currency, which addresses money laundering and terrorist finance risks. Research revealed that digital currency regulations should mirror MSB regulations to curb peer-to-peer digital currency exchanges (Kirby, 2014). Additionally, FinCENs purview with financial crimes provides a unique position to assist law enforcement with digital currency investigations (FinCEN, 2014). A need exists for FinCEN to develop a blockchain analysis tool for law enforcement agencies and to assist with complex digital currency investigations (DHS, 2014). Keywords: Economic Crime Management, Financial Crime and Compliance Management, Paul Pantiani, virtual currency, cryptocurrency."
}
