{
    "id": "georgeta2016virtual",
    "title": "Virtual Currency \"Bitcoin\" -- Challenges And Controversies",
    "year": 2016,
    "type": "article",
    "sortkey": 20160808,
    "authors": [
        {
            "name": "Soava Georgeta", "affiliation": "University of Craiova"
        },
        {
            "name": "Mehedintu Anca", "affiliation": "University of Craiova"
        },
        {
            "name": "Sitnikov Catalina", "affiliation": "University of Craiova"
        }
    ],
    "venue": "Annals-Economy Series",
    "peer-reviewed": true,
    "abstract": "In the knowledge society, when there is a rapidly evolving information technology, the virtual markets, namely the online transactions, have created the premises emergence and development of new technologies of using of finances, namely virtual coin (Bitcoin). Use of this coin appears as an alternative to traditional currencies, but they are not under the control of no body, are devoid of inflation and maintain the anonymity of users. Following the evolution of this new type of coin, we proposed in this paper to present some general aspects of this coin focusing on global controversies on using Bitcoin. We have reviewed several myths that have arisen with the development and penetration of its on market and because it is a volatile coin can generate huge gains but and huge losses, we have studied fluctuation and implications for users and investors and the attraction of the drug dealers and criminals for using virtual currency, Bitcoin. At the end of the paper, based on the analysis we have tried to outline the future of this modern payment system. Thus, we found that lately, in that its value has fluctuated strongly, and increased buyer confidence, but appeared and increased cyber attacks, and the fear that if the state has no a role in protecting citizens from fraud, we can assist at the development of financial schemes extremely dangerous. The financial experts believe that if the world banks would jointly solve all the problems, the virtual money will have a real chance of life.",
    "url": "http://www.utgjiu.ro/revista/ec/pdf/2016-03/46_SOAVA,%20MEHEDINTU,%20SITNIKOV.pdf"
}
