{
    "id": "gipp2017cryptsubmit",
    "title": "Cryptsubmit: Introducing Securely Timestamped Manuscript Submission And Peer Review Feedback Using The Blockchain",
    "year": 2017,
    "type": "article",
    "sortkey": 20170517,
    "authors": [
        {
            "affiliation": "University of Konstanz",
            "name": "Bela Gipp"
        },
        {
            "affiliation": "University of Konstanz",
            "name": "Corinna Breitinger"
        },
        {
            "affiliation": "University of Konstanz",
            "name": "Norman Meuschke"
        },
        {
            "affiliation": "Trinity College Dublin",
            "name": "Joeran Beel"
        }
    ],
    "url": "https://www.gipp.com/wp-content/papercite-data/pdf/gipp2017b.pdf",
    "peer-reviewed": false,
    "abstract": "Manuscript submission systems are a central fixture in scholarly publishing. However, researchers who submit their unpublished work to a conference or journal must trust that the system and its provider will not accidentally or willfully leak unpublished findings. Additionally, researchers must trust that the program committee and the anonymous peer reviewers will not plagiarize unpublished ideas or results. To address these weaknesses, we propose a method that automatically creates a publicly verifiable, tamper-proof timestamp for manuscripts utilizing the decentralized Bitcoin blockchain. The presented method hashes each submitted manuscript and uses the API of the timestamping service OriginStamp to persistently embed this manuscript hash on Bitcoin’s blockchain. Researchers can use this tamper-proof trusted timestamp to prove that their manuscript existed in its specific form at the time of submission to a conference or journal. This verifiability allows researchers to stake a claim to their research findings and intellectual property, even in the face of vulnerable submission platforms or dishonest peer reviewers. Optionally, the system also associates trusted timestamps with the feedback and ideas shared by peer reviewers to increase the traceability of ideas. The proposed concept, which we introduce as CryptSubmit, is currently being integrated into the open-source conference management system OJS. In the future, the method could be integrated at nearly no overhead cost into other manuscript submission systems, such as EasyChair, ConfTool, or Ambra. The introduced method can also improve electronic preprint services and storage systems for research data."
}
