{
    "id": "gross2017role",
    "title": "The Role Of Secondary Sources On The Taxation Of Digital Currency (Bitcoin) Before Irs Guidance Was Issued",
    "year": 2017,
    "type": "article",
    "sortkey": 20170305,
    "authors": [
        {
            "affiliation": "Southern Illinois University Edwardsville",
            "name": "Andrew Gross"
        },
        {
            "affiliation": "Southern Illinois University Edwardsville",
            "name": "Jeff Hemker"
        },
        {
            "affiliation": "Southern Illinois University Edwardsville",
            "name": "Jamie Hoelscher"
        },
        {
            "affiliation": "Southern Illinois University Edwardsville",
            "name": "Brad Reed"
        }
    ],
    "url": "http://www.sciencedirect.com/science/article/pii/S0748575116302159",
    "venue": "Journal of Accounting Education",
    "peer-reviewed": true,
    "abstract": "This case explores the tax issues related to transactions when substantial authoritative guidance is lacking. The case involves the Winklevoss twins’ purchase of tickets on Virgin Galactic’s SpaceshipTwo using the digital currency Bitcoins. At the time the purchase was made, there was no substantial tax guidance related to digital currency transactions. Since the Winklevoss twins anticipate future Bitcoin transactions, they have come to you to help them understand how their use of digital currency was previously reported and how the recent IRS guidance will affect those reporting decisions. You will be required to assume the role of the Winklevoss twins’ professional tax advisor at the time of the original transaction, before the IRS provided guidance regarding Bitcoin transactions. You will need to determine if the appreciation in the Bitcoins should have been reported as taxable income. If so, you will need to determine whether the Bitcoins should be treated as currency or property potentially subject to the capital gain/loss rules. You will need to find secondary authorities available at the time, to provide professional guidance. You should compare the guidance provided by secondary sources to the guidance subsequently issued by the IRS. Finally, you should discuss whether or not an amended return is required, permissible or beneficial."
}
