{
    "id": "kapoor2016regulating",
    "title": "Regulating The Bitcoin Ecosystem",
    "authors": [
	{"name": "Rishabh Kapoor", "affiliation": "TU Delft, Delft University of Technology"}
    ],
    "abstract": "Bitcoin is a peer to peer decentralized virtual currency, released online through a research paper in 2008 by the unknown Satoshi Nakamoto. Around the world, many countries have cautiously taken minor initiatives to address the regulatory issues, due to its rising popularity. The regulation is not seen as complete, due to the nascent and novel outlook of bitcoins, requiring time for analysis and empirical evidence. The main research question that needs to be answered, is how can governance ideas be conceptualized to support technological decentralization while protecting against illegal activities? To answer this question a literature review is performed across academia, digital media and conferences/ independent authors. From this study, ideas for frameworks are consolidated, to effectively regulate bitcoins through coalitions, analyzed with game theory. This is complemented with a theoretical understanding of the technical, political, economical and ethical issues surrounding the bitcoin ecosystem.\n\nThe thesis is broadly divided into seven chapters, where initially an introduction is presented which presents the structure of the thesis, along with the research problem and its motivation. This is followed by an exploration of bitcoin's current framework, which forms the most important theoretical part of the thesis. Here, its system design, strengths, challenges and solutions to regulatory issues are detailed. Also, how bitcoin is being perceived globally across twenty nations, is presented. Being an economic system, there has been reasonable skepticism, as to its validity as a money system. This is presented in the next chapter, where its economic structure is first explored, which is followed by an analysis of bitcoin from the perspective of both Austrian economics and Keynesian economics. Further, to understand the overall validity of a new system, the ethical impacts must be considered. This has been analyzed through two frameworks in this thesis. Firstly, as a large social experiment and secondly through a standard ethical impact assessment.\n\nAlso, bitcoin has always been portrayed in the popular press, as promoting only decentralization. This is critically analyzed, from classical ideas of noted humanitarian M.K Gandhi and British economist M.F Schumacher. As a follow up, a modern exponential technology framework presented by Singularity University, is offered as a comparison. It is observed that bitcoin excels in the material aspect of decentralization (while requiring centralized intermediaries), but struggles in the spiritual aspect, as detailed. The major regulatory solution offered in this thesis, is through coalitions among stakeholders. For clarity, seven crisis situations are highlighted with the different payoff's (relative power) among the different members assigned, with proper reasoning and a demo game explained. Finally, conclusions and favorable recommendations are drawn , along with sections on research limitations, future research and reflections. Also, an appendix section on the major digital media outlook, is presented for two years (Aug'13- Sep'15), to explain its popular portrayal and the opinion of the general audience.\n\nOverall, it can be said that it is still early days for bitcoin and there are major critics in every domain. Consistent issues with taxation, anonymity tools like TOR promoting illegal activities, its inherent economic value and price volatility exist. The internet as an information medium, is probably the only suitable precedent for bitcoin which has been far more successful than anticipated. The benefits of bitcoin from exponentially lower transaction fees, global banking outreach, framework for decentralized rehasset ownership transfer and its ability to impact the Monetary Policy of ruling governments have been appreciated. Further, as a practical lesson, policy makers could see mainstream bitcoin as promoting a balance of centralized and decentralized intermediaries. Any effort at promoting an extreme ideology could have long term negative effects. Also, offering technologies like bitcoin a fair trial run would be far more appropriate than inviting legally controversial use. With over hundred competing digital currencies, the question is certainly not if, but when they would be competitive with fiat currencies.",
    "year": 2016,
    "peer-reviewed": false
}
