{
    "id": "kiayias2016blockchain",
    "title": "Blockchain Mining Games",
    "year": 2016,
    "type": "inproceedings",
    "sortkey": 20160728,
    "authors": [
        {
            "name": "Aggelos Kiayias", "affiliation": "University of Edinburgh"
        },
        {
            "name": "Elias Koutsoupias", "affiliation": "University of Oxford"
        },
        {
            "name": "Maria Kyropoulou", "affiliation": "University of Oxford"
        },
        {
            "name": "Yiannis Tselekounis", "affiliation": "National and Kapodistrian University of Athens"
        }
    ],
    "venue": "ACM Conference on Economics and Computation",
    "peer-reviewed": true,
    "abstract": "We study the strategic considerations of miners participating in the bitcoin's protocol. We formulate and study the stochastic game that underlies these strategic considerations. The miners collectively build a tree of blocks, and they are paid when they create a node (mine a block) which will end up in the path of the tree that is adopted by all. Since the miners can hide newly mined nodes, they play a game with incomplete information. Here we consider two simplified forms of this game in which the miners have complete information. In the simplest game the miners release every mined block immediately, but are strategic on which blocks to mine. In the second more complicated game, when a block is mined it is announced immediately, but it may not be released so that other miners cannot continue mining from it. A miner not only decides which blocks to mine, but also when to release blocks to other miners. In both games, we show that when the computational power of each miner is relatively small, their best response matches the expected behavior of the bitcoin designer. However, when the computational power of a miner is large, he deviates from the expected behavior, and other Nash equilibria arise.",
    "url": "http://delivery.acm.org/10.1145/2950000/2940773/p365-kiayias.pdf"
}
