{
    "id": "liang2017provchain",
    "title": "Provchain: A Blockchain-Based Data Provenance Architecture In Cloud Environment With Enhanced Privacy And Availability",
    "year": 2017,
    "type": "inproceedings",
    "sortkey": 20170504,
    "authors": [
        {
            "affiliation": "Tennessee State University",
            "name": "Xueping Liang"
        },
        {
            "affiliation": "Old Dominion University",
            "name": "Sachin Shetty"
        },
        {
            "affiliation": "Norfolk State University",
            "name": "Deepak Tosh"
        },
        {
            "affiliation": "Air Force Research Laboratory",
            "name": "Charles Kamhoua"
        },
        {
            "affiliation": "Air Force Research Laboratory",
            "name": "Kevin Kwiat"
        },
        {
            "affiliation": "Air Force Research Laboratory",
            "name": "Laurent Njilla"
        }
    ],
    "url": "https://www.cse.unr.edu/~toshd/assets/provchain.pdf",
    "venue": "International Symposium on Cluster, Cloud and Grid Computing",
    "peer-reviewed": true,
    "abstract": "Cloud data provenance is metadata that records the history of the creation and operations performed on a cloud data object. Secure data provenance is crucial for data accountability, forensics and privacy. In this paper, we propose a decentralized and trusted cloud data provenance architecture using blockchain technology. Blockchain-based data provenance can provide tamper-proof records, enable the transparency of data accountability in the cloud, and help to enhance the privacy and availability of the provenance data. We make use of the cloud storage scenario and choose the cloud file as a data unit to detect user operations for collecting provenance data. We design and implement ProvChain, an architecture to collect and verify cloud data provenance, by embedding the provenance data into blockchain transactions. ProvChain operates mainly in three phases: (1) provenance data collection, (2) provenance data storage, and (3) provenance data validation. Results from performance evaluation demonstrate that ProvChain provides security features including tamper-proof provenance, user privacy and reliability with low overhead for the cloud storage applications."
}
