{
    "id": "luu2016sharding",
    "title": "A Secure Sharding Protocol For Open Blockchains",
    "authors": [
	{"name": "Loi Luu", "affiliation": "National University of Singapore"},
	{"name": "Viswesh Narayanan", "affiliation": "National University of Singapore"},
	{"name": "Chaodong Zheng", "affiliation": "National University of Singapore"},
	{"name": "Kunal Baweja", "affiliation": "National University of Singapore"},
	{"name": "Seth Gilbert", "affiliation": "National University of Singapore"},
	{"name": "Prateek Saxena", "affiliation": "National University of Singapore"}
    ],
    "year": 2016,
    "peer-reviewed": true,
    "venue": "Computer and Communications Security",
    "url": "http://dl.acm.org/ft_gateway.cfm?id=2978389&ftid=1805683&dwn=1&CFID=819050260&CFTOKEN=41316016",
    "abstract": "Cryptocurrencies, such as Bitcoin and 250 similar alt-coins, embody at their core a blockchain protocol --- a mechanism for a distributed network of computational nodes to periodically agree on a set of new transactions. Designing a secure blockchain protocol relies on an open challenge in security, that of designing a highly-scalable agreement protocol open to manipulation by byzantine or arbitrarily malicious nodes. Bitcoin's blockchain agreement protocol exhibits security, but does not scale: it processes 3--7 transactions per second at present, irrespective of the available computation capacity at hand. In this paper, we propose a new distributed agreement protocol for permission-less blockchains called ELASTICO. ELASTICO scales transaction rates almost linearly with available computation for mining: the more the computation power in the network, the higher the number of transaction blocks selected per unit time. ELASTICO is efficient in its network messages and tolerates byzantine adversaries of up to one-fourth of the total computational power. Technically, ELASTICO uniformly partitions or parallelizes the mining network (securely) into smaller committees, each of which processes a disjoint set of transactions (or \"shards\"). While sharding is common in non-byzantine settings, ELASTICO is the first candidate for a secure sharding protocol with presence of byzantine adversaries. Our scalability experiments on Amazon EC2 with up to $1, 600$ nodes confirm ELASTICO's theoretical scaling properties.",
    "type": "inproceedings",
    "sort-key": 20161030
}
