{
    "id": "malcic2016block",
    "title": "In Block Chains We Trust: Bitcoin and the Moral Economy of Digital Address",
    "year": 2016,
    "type": "inproceedings",
    "authors": [
        {
            "name": "Steven Malcic"
        }
    ],
    "venue": "SASE 28th Annual Conference Theme",
    "peer-reviewed": true,
    "url": "https://sase.confex.com/sase/2016am/webprogram/Paper5206.html",
    "abstract": "In 2008, an unknown author using the pseudonym Satoshi Nakamoto distributed a white paper outlining what he called “a peer-to-peer electronic cash system.”  In this document, Nakamoto outlines a commons knowledge project called Bitcoin.  Put simply, Bitcoin is the name given to a network process through which users exchange up to 21 million bitcoins, a manufactured scarcity intended to regulate the market.  Each bitcoin is itself an ID number, and a publicly available ledger called the “block chain” ensures the validity of each transaction through checks among Bitcoin nodes. This digital currency became notorious for its connection to Silk Road, a now defunct website once devoted to the brokerage of illegal transactions.  Even though popular reports on Bitcoin inevitably focus on its use as anonymous money in black markets, the problem of digital currency is more deeply a problem of network address.  An individual bitcoin is nothing more than ID number, after all. In this paper, I argue that the digital address, itself a discrete and historically produced technological arrangement, functions as a constitutive control structure of “trust” online, one that promises to gradually subordinate gift practices for the sake of a public ledger.  Using original archival research conducted at the Computer History Museum in Mt. View, California, I critique the design philosophy of early Internet engineers to show how the digital address emerged to consist of three parts: 1) an ID number, as assigned and managed according to the TCP/IP suite; 2) a named subjectivity, as assigned and managed according to the Domain Name System (DNS); and 3) a point-of-view, contingently associated with whatever human intelligence directs the machines according to the end-to-end design arguments.  As early Internet designers layered the network architecture, they simultaneously layered differing notions of identity, subjectivity, and point-of-view, each descending from unique intellectual traditions that inform TCP/IP, the DNS, and the end-to-end arguments, respectively.  This logic of addressing provided the principles for our current system of global Internet governance, as the digital address is most often associated with Internet governance institutions such as ICANN, WSIS, and IGF. The historical emergence of TCP/IP, the DNS, and the end-to-end arguments reified conceptual principles that delimit what I refer to as the moral economy of digital address.  I show how the logic of addressing that buttresses ICANN also underlies emergent systems of digital correspondence including block chains, the basis of digital currency like Bitcoin.  Even though Bitcoin manages digital addresses, Bitcoin itself is based on the historical emergence of the digital address, along with any attendant parameters the digital address might technologically afford.  As digital addressing is mathematically precise and hierarchical, it might function well as the constituent logic for a trustless currency."
}
