{
    "id": "piazza2017bitcoin",
    "title": "Bitcoin In The Dark Web: A Shadow Over Banking Secrecy And A Call For Global Response",
    "year": 2017,
    "type": "article",
    "sortkey": 20170606,
    "authors": [
        {
            "name": "Fiammetta Piazza"
        }
    ],
    "url": "https://litigation-essentials.lexisnexis.com/webcd/app?action=DocumentDisplay&crawlid=1&doctype=cite&docid=26+S.+Cal.+Interdis.+L.J.+521&srctype=smi&srcid=3B15&key=f27a28b523692a1865da63d4ec8ee220",
    "peer-reviewed": false,
    "abstract": "Revolution and evolution are often two sides of the same coin. Since the industrial revolution, law and technology are in constant chase of each other like a statue and its shadow. The Internet - just as the telegraph, the telephone, and airplanes before it - has become as easy to access as it is hard to grasp. This discrepancy may be considered as one of the reasons for the current lack of comprehensive regulation of the Web. However one wishes to approach the regulation of the Internet, the Internet is not no man's land and as such, especially the remote and least known area of the Dark Web, requires more detailed regulation, particularly when lack thereof frustrates goals generally pursued outside cyberspace. Virtual currencies play a key role in the transformational change affecting the world economy given the expanded venues available to consumers to access goods and services since the advent of the Web. 1 Indeed, virtual currencies offer a peer-to-peer exchange mechanism whereby traditional central clearinghouses are avoided. 2 However, while virtual currencies are not legal tender, they may have equivalent traditional currency value. 3 Within this category, Bitcoin has developed and gained a primary status among virtual currencies that can be exchanged for traditional currencies. 4 This reality is complicated considering the role of the Dark Web: a layer of the Web accessible only through specific software and where users can maintain nearly absolute anonymity. 5"
}
