{
    "id": "pope2016governing",
    "title": "Governing eMoney: On Bitcoin \\& Global Governance",
    "year": 2016,
    "authors": [
        {
            "name": "DeAnna Lee Pope", "affiliation": "Johns Hopkins University"
        }
    ],
    "type": "masterthesis",
    "peer-reviewed": false,
    "abstract": "Numismatics (the study of money) shows that money evolved from trade-and-barter systems to metal coins to fiat money to electronic money, the future of currency. EMoney is a new phenomenon that raises an essential question for the international and national communities affected: how is it to be governed? Bitcoin was launched in 2009 as “the first decentralized convertible virtual currency, and the first cryptocurrency” (FATF 2014: 7). What makes Bitcoin so easily accessible its ability for anyone in the world to simply download the free, open-source software to engage in Bitcoin transactions? Bitcoin was the first “electronic cash system that uses decentralized [peer-to-peer] networking to enable irreversible [anonymous] payments” invented by Satoshi Nakamoto, and it is the most widespread (Maurer 2013: 261). This paper is about how new virtual currencies such as Bitcoin are subject to global, national, and private governance. This work contributes to the literature both on global governance and on money and global political economy literature on monetary systems. It includes the conduct of a survey and the use of documentary evidence. This thesis asks the question, should electronic currencies be governed the same way as traditional currencies, and if so, how? To explore the range of answers to these questions, this paper is outlined in the following five sections. First, the topic of governing eMoney will be introduced and relevant terms will be defined. Second, a comprehensive background summarizing the new phenomenon that is virtual currency as well as a discussion of the role of distributed ledgers is combined with a history of money—in theory and in history—will be used to draw comparisons between characteristics and historical tendencies from Bretton Woods-era Economics. Third, this paper’s literature review shows how Bitcoin fits into the history of private and virtual currencies, leaving room for its origin story, as well as others in scrip. This section will also discuss how to account for the governance of eMoney in terms of regulation, discussing the three main approaches scholars and organizations bring up—domestic law, best practices, and global regime approaches to regulation. Fourth, the evidence section of this paper details the research design and procedure of this thesis as well as providing examples in each of the kinds of evidence—documentary, descriptive, and primary. This part also introduces this literature’s arguably two most important case studies in Bitcoin’s problematic history, Mt. Gox and the Silk Road. This part draws from these case studies to compare Bitcoin as a potential form of money and assess its volatility and risk. This section will provide new empirical evidence on current uses of eMoney, particularly Bitcoin, through a discussion of this thesis’ primary sources, primarily an online survey. This section begins with a detailed description of the methods and preparation used for these studies. In addition to what users say in new evidence presented by this paper, a culmination of what international organizations, private entities, and national organizations have to say for how virtual currencies play into the global political economy follows in the section on regulatory and policy challenges. Finally, the thesis concludes with an analytical section on the ways in which Bitcoin challenges our understanding of the Global Political Economy and how it pertains to globalization, as well as potential solutions to the issue on how eMoney is to be governed and recommendations for further research.",
    "url": "http://www.academia.edu/download/45863655/Bitcoin_Thesis_Pope__DeAnna_FINAL_PDF.pdf"
}
