{
    "id": "ram2016initial",
    "title": "Accounting for the Bitcoin: An Initial Perspective",
    "authors": [
	{"name": "Asheer Jaywant Ram", "affiliation": "University of the Witwatersrand"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "http://wiredspace.wits.ac.za/bitstream/handle/10539/20186/Accounting%20for%20the%20Bitcoin%20-%20An%20Initial%20Perspective%20by%20Asheer%20J.%20Ram.pdf?sequence=1",
    "abstract": "The Bitcoin is a form of decentralised virtual money, which exists solely electronically and transcends international boundaries and regulations. Given its innovative characteristics and increasing popularity in the economic and technological worlds, which are explored in this paper, the Bitcoin and other virtual ‗currencies‘ are expected to become mainstream, leading to a need for accounting treatment. Currently, there is no guidance on how to account for transactions involving the Bitcoin. The aim of this paper is to determine a conceptual approach to accounting for the Bitcoin, making use of the theories of neoliberalism and stewardship. A qualitative analysis is applied where the relevant literature is analysed to identify key characteristics of the Bitcoin. A similar exercise is carried out to identify the accounting policy themes. The Bitcoin characteristics and the accounting policy themes form the row and column headings respectively in the correspondence table. This correspondence table was provided to 40 respondents. Their responses were analysed using the statistical program Stata and summary statistics and a visual representative map (known as a correspondence plot) of the relationship between the Bitcoin characteristics and the accounting policy themes were generated. After the initial analysis, 5 interviews were conducted with accounting experts to provide insights into the interpretation of the visual map. In conclusion, a normatively recommended accounting policy for the Bitcoin consists of recognition on control and fair value as the preferred measurement base with emphasis on the business model and intention of the entity holding the Bitcoins",
    "type": "masterthesis"
}
