{
    "id": "rauchs2016cryptocurrencies",
    "title": "Cryptocurrencies Meeting Business Ecosystems: The Case of Bitcoin",
    "authors": [
	{"name": "Michael Rauchs", "affiliation": "Grenoble Ecole de Management"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "https://www.researchgate.net/profile/Michel_Rauchs/publication/308042418_Cryptocurrencies_meeting_business_ecosystems_The_case_of_Bitcoin/links/57d806eb08ae6399a3990d91.pdf",
    "abstract": "Bitcoin, a decentralised cryptocurrency system conceived by a mysterious person or group of people using the pseudonym “Satoshi Nakamoto”, promises to revolutionise the way that we think about money and the transfer of value in general. After a quiet launch in 2009, it has evolved several years later into a multi-billion dollar industry and has inspired the creation of hundreds of similar cryptocurrency systems. However, little research has been undertaken so far to study the vibrant business ecosystems that form around these decentralised networks. The aim of this project is thus to explore the emergence of the Bitcoin business ecosystem and its evolving structure using a data-driven approach, and identify the factors that drive this evolution. For this purpose, a theoretical market segment framework is developed and applied to a longitudinal dataset of 514 companies and projects that was specifically built for this project. Using a visualisation approach, the business ecosystem is mapped in terms of the affiliations of entities to market segments over a time window from 2010-2015 in order to visually analyse how the structure evolves. The key findings and observations are presented and several factors influencing the evolution of the business ecosystem are identified. Finally, the results are discussed in relation to the existing theory. The project provides the first comprehensive and data-driven analysis of the Bitcoin business ecosystem and offers interesting insights into its structure and evolution. Moreover, it contributes to the understanding of the factors that drive this evolution and provides a unique dataset that can be used for further research.",
    "type": "masterthesis",
    "sort-key": 20160928
}
