{
    "id": "sallal2017proximity",
    "title": "Proximity Awareness Approach To Enhance Propagation Delay On The Bitcoin Peer-To-Peer Network",
    "year": 2017,
    "type": "inproceedings",
    "sortkey": 20170509,
    "authors": [
        {
            "affiliation": "University of Portsmouth",
            "name": "Muntadher Sallal"
        },
        {
            "affiliation": "University of Portsmouth",
            "name": "Gareth Owenson"
        },
        {
            "affiliation": "University of Portsmouth",
            "name": "Mo Adda"
        }
    ],
    "url": "https://researchportal.port.ac.uk/portal/en/publications/proximity-awareness-approach-to-enhance-propagation-delay-on-the-bitcoin-peertopeer-network(fa069ec9-e88a-420d-8555-2dd7ed0a25c8)/export.html",
    "venue": "International Conference on Distributed Computing Systems",
    "peer-reviewed": true,
    "abstract": "In the Bitcoin system, a peer-to-peer electronic currency system, the delay overhead in transaction verification prevents the Bitcoin from gaining increasing popularity nowadays as it makes the system vulnerable to double spend attacks. This paper introduces a proximity-aware extension to the current Bitcoin protocol, named Bitcoin Clustering Based Ping Time protocol (BCBPT). The ultimate purpose of the proposed protocol, that is based on how the clusters are formulated and the nodes define their membership, is to improve the transaction propagation delay in the Bitcoin network. In BCBPT, the proximity of connectivity in the Bitcoin network is increased by grouping Bitcoin nodes based on ping latencies between nodes. We show, through simulations, that the proximity base ping latency defines better clustering structures that optimize the performance of the transaction propagation delay. The reduction of the communication link cost measured by the information propagation time between nodes is mainly considered as a key reason for this improvement. Bitcoin Clustering Based Ping Time protocol is more effective at reducing the transaction propagation delay compared to the existing clustering protocol (LBC) that we proposed in our previous work."
}
