{
    "id": "seetharaman2017impact",
    "title": "Impact Of Bitcoin As A World Currency",
    "year": 2017,
    "type": "article",
    "sortkey": 20170530,
    "authors": [
        {
            "affiliation": "S P Jain School of Global Management",
            "name": "A Seetharaman"
        },
        {
            "affiliation": "S P Jain School of Global Management",
            "name": "AS Saravanan"
        },
        {
            "affiliation": "S P Jain School of Global Management",
            "name": "Nitin Patwa"
        },
        {
            "affiliation": "S P Jain School of Global Management",
            "name": "Jigar Mehta"
        }
    ],
    "url": "http://sciedu.ca/journal/index.php/afr/article/download/11580/7121",
    "venue": "Accounting and Finance Research",
    "peer-reviewed": true,
    "abstract": "In an era of technology advancement when the entire world is talking about the “Internet of Things” whereby we are expected to have connectivity between anything and everything, Currency cannot be left behind. Paper currency is bound to be a thing of past, as virtual currencies will start taking over and Bitcoin is well poised to achieve this feat. Not only it will revolutionize the way payments are made, but also have potential to impact the future of world currencies like USD, which is already facing challenges from EURO or Chinese Yuan Renminbi (CNY). The rise of crypto-currencies will add a new dimension to this challenge for US Dollar (USD) The focus of this study is to understand multiple factors which are translating Bitcoin (BTC) that is gaining momentum in various fields of global finance and how disruptive it can be, including replacing main fiat currencies in the financial system impacting mainly USD. The key variables studied are Regulation or lack of it around Bitcoin, Bitcoin Technology, Bitcoin Economy and the usage of Bitcoin as a Currency. This research used the latest statistical tool ADANCO 1.1.1 by Henseler and Dijkstra (2015) to analyze the data collected by building a partial least squares structural equation model (PLS-SEM). The observations of this study will help understand the future of global finance from multiple standpoints, especially Regulation, Cryptocurrencies and the fiat currencies."
}
