{
    "id": "seppala2016trust",
    "title": "The Role ofOC Trust in Understanding the Effects of Blockchain on Business Models",
    "authors": [
	{"name": "Jane Seppälä", "affiliation": "Aalto University"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "https://aaltodoc.aalto.fi/bitstream/handle/123456789/23302/master_Sepp%C3%A4l%C3%A4_Jane_2016.pdf?sequence=1",
    "abstract": "Blockchain technology is a systemic transaction innovation in information processing. It enables trust-reliant transactions between parties that were previously unable to trust each other by means of an immutable transaction log and verification of order and validity of transactions, among other things. Blockchain technology is a new way to integrate old technologies, such as digital signatures, cryptography, and hash functions, but as an innovation it is just at the start of its evolution. This is an important topic to study, for it is still poorly understood, but anticipated to be a disruptive technological innovation. This work studies how blockchain technology could change business models, and especially what is the role of trust in this change. The theoretical frame for this study comes from trust literature. This study started with a literature review, based on which two hypotheses were created that were tested with a comparative case study of two companies, one from energy and one from financial services industry. The primary material was collected from 25 interviews, each lasting for about an hour. In addition to the two case companies, the sample included experts from the industries and blockchain specialists. Based on the interviews and other material, I constructed three hypothetical use cases that both illustrate how blockchain technology can be used and present an opportunity for analysis of business models. The most important conclusions of this study divide into two. First of all, the research clarifies the strategic understanding of blockchain technology by presenting a framework for use case evaluation and by opening the opportunity offered by blockchain to increase trust or to negate the need for it in a transaction. Secondly, this study offers implications both for companies and for further study, indicating that blockchain use cases are very difficult to find. Further, the role of trust in an industry seems to have an effect on what kinds of changes blockchain can cause in business models. Blockchain technology can thus be considered both a technological and a business model innovation, and making a distinction between the two is important. As a business model innovation, blockchain could disrupt business models in a wide range of industries and geographical locations.",
    "type": "masterthesis",
    "sort-key": 20161110
}
