{
    "id": "ylihuumo2016where",
    "title": "Where Is Current Research on Blockchain Technology?—A Systematic Review",
    "authors": [
	{"name": "Jesse Yli-Huumo", "affiliation": "Lappeenranta University of Technology"},
	{"name": "Deokyoon Ko", "affiliation": "Sogang University"},
	{"name": "Sujin Choi", "affiliation": "Sogang University"},
	{"name": "Sooyong Park", "affiliation": "Sogang University"},
	{"name": "Kari Smolander", "affiliation": "Aalto University"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0163477",
    "abstract": "Blockchain is a decentralized transaction and data management technology developed first for Bitcoin cryptocurrency. The interest in Blockchain technology has been increasing since the idea was coined in 2008. The reason for the interest in Blockchain is its central attributes that provide security, anonymity and data integrity without any third party organization in control of the transactions, and therefore it creates interesting research areas, especially from the perspective of technical challenges and limitations. In this research, we have conducted a systematic mapping study with the goal of collecting all relevant research on Blockchain technology. Our objective is to understand the current research topics, challenges and future directions regarding Blockchain technology from the technical perspective. We have extracted 41 primary papers from scientific databases. The results show that focus in over 80% of the papers is on Bitcoin system and less than 20% deals with other Blockchain applications including e.g. smart contracts and licensing. The majority of research is focusing on revealing and improving limitations of Blockchain from privacy and security perspectives, but many of the proposed solutions lack concrete evaluation on their effectiveness. Many other Blockchain scalability related challenges including throughput and latency have been left unstudied. On the basis of this study, recommendations on future research directions are provided for researchers. ",
    "type": "article",
    "sort-key": 20161012
}
