{
    "id": "walch2017path",
    "title": "The Path Of The Blockchain Lexicon (And The Law)",
    "year": 2017,
    "type": "article",
    "sortkey": 20170408,
    "authors": [
        {
            "name": "Angela Walch"
        }
    ],
    "url": "https://www.bu.edu/rbfl/files/2017/02/The-Path-of-the-Blockchain-Lexicon-Feb-13-2017-Draft.pdf",
    "peer-reviewed": true,
    "venue": "Boston University Review of Banking & Financial Law",
    "abstract": "On January 8, 1897, “the most important event in American legal history to have taken place at Boston University School of Law” occurred.1 Oliver Wendell Holmes, Jr., then an Associate Justice of the Massachusetts Supreme Judicial Court, delivered a speech entitled “The Path of the Law” to a group of law students, faculty, judges, and practicing attorneys.2 Touching on many themes that foreshadowed the Legal Realism movement, the speech became a classic of legal theory.3 In the speech, Holmes explored the “unnecessary confusion” created by the use of legal terms that carry the baggage of “moral significance” and “ethical associations.”4 He noted that, “[t]he law is full of phraseology drawn from morals, and by the mere force of language continually invites us to pass from one domain to the other without perceiving it, as we are sure to do unless we have the boundary constantly before our eyes.”5 Holmes speculated whether it would not be a gain if every word of moral significance could be banished from the law altogether, and other words adopted which should convey legal ideas uncolored by anything outside the law. We should lose the fossil records of a good deal of history and majesty got from ethical associations, but by ridding ourselves of an unnecessary confusion we should gain very much in the clearness of our thought.6 One hundred twenty years later at Boston University School of Law, Holmes’ insights into the problems indeterminate language creates for law remain relevant. This essay picks up on the linguistic challenges identified by Holmes, and explores the confusion they can sow for regulators grappling with blockchain technology."
}
