{
    "id": "yli2016prospects",
    "title": "Prospects of Bitcoin diffusion",
    "authors": [
	{"name": "Harri-Pekka Yli-Kovero", "affiliation": "University of Turku"}
    ],
    "year": 2016,
    "peer-reviewed": false,
    "url": "http://doria32-kk.lib.helsinki.fi/handle/10024/122829",
    "abstract": "Currency is something people deal with every day in their lives. The contemporary society is very much revolving around currencies. Even though technological development has been rapid, the principle of currency has stayed relatively unchanged for a long time. Bitcoin is a digital currency that introduced an alternative to other digital currencies, and to the traditional physical currencies. Bitcoin is peer-to-peer, open source, and it erases the need of a third party in transactions. Bitcoin has since inception gained certain fame, but it has not established itself as a common currency in the world. The purpose of this study was to analyse what kind of potential does Bitcoin have to become a widely accepted currency in day-to-day transactions. The main research question was divided into three sub questions:\n•	What kind of a process is the diffusion of new innovations?\n•	What kinds of factors speak for the wider adoption of Bitcoin? \n•	What kinds of factors speak against the wider adoption of Bitcoin? \nThe purpose of the study was approached by having diffusion of innovations as the theoretical framework. The four elements in diffusion of innovations are, innovation, communication, time, and social system. The theoretical framework is applied to Bitcoin, and the research questions answered by analysing Bitcoin’s potential diffusion prospects. The body of research data consisted of media texts and statistics. In this study, content analysis was the research method.\nThe main findings of the study are that Bitcoin has clear strengths, but it faces a large amount of uncertainty. Bitcoin’s strong areas are the transactions. They are fast, easy, and cheap. From the innovation diffusion perspective Bitcoin is still relatively unknown, and the general public’s attitudes towards it are sceptical. The research findings purport that Bitcoin has potential demand especially when the financial system of a region is dysfunctional, or when there is a financial crisis.\nBitcoin is not very trusted, and the majority of people do not see a reason to start using Bitcoin in the future. A large number of people associate it with illegal activities. In general people are largely unaware of what Bitcoin is or what are the strengths and weaknesses. Bitcoin is an innovative alternative currency. However, unless people see a major need for Bitcoin due to a financial crisis, or dysfunctionality in the financial system, Bitcoin will not become much more widespread as it is today. Bitcoin’s underlying technology can be harnessed to multiple uses. Developments in that field in the future are something that future researchers could look into."
}
