{
    "id": "zeilinger2016digital",
    "title": "Digital Art As ‘Monetised Graphics’: Enforcing Intellectual Property On The Blockchain",
    "year": 2016,
    "type": "article",
    "sortkey": 20161210,
    "authors": [
        {
            "affiliation": "Anglia Ruskin University",
            "name": "Martin Zeilinger"
        }
    ],
    "url": "http://link.springer.com/article/10.1007/s13347-016-0243-1",
    "venue": "Philosophy & Technology",
    "peer-reviewed": true,
    "abstract": "In a global economic landscape of hyper-commodification and financialisation, efforts to assimilate digital art into the high-stakes commercial art market have so far been rather unsuccessful, presumably because digital artworks cannot easily assume the status of precious object worthy of collection. This essay explores the use of blockchain technologies in attempts to create proprietary digital art markets in which uncommodifiable digital artworks are financialised as artificially scarce commodities. Using the decentralisation techniques and distributed database protocols underlying current cryptocurrency technologies, such efforts, exemplified here by the platform Monegraph, tend to be presented as concerns with the interest of digital artists and with shifting ontologies of the contemporary work of art. I challenge this characterisation, and argue, in a discussion that combines aesthetic theory, legal and philosophical theories of intellectual property, rhetorical analysis and research in the political economy of new media, that the formation of proprietary digital art markets by emerging commercial platforms such as Monegraph constitutes a worrisome amplification of long-established, on-going efforts to fence in creative expression as private property. As I argue, the combination of blockchain-based protocols with established ambitions of intellectual property policy yields hybrid conceptual-computational financial technologies (such as self-enforcing smart contracts attached to digital artefacts) that are unlikely to empower artists but which serve to financialise digital creative practices as a whole, curtailing the critical potential of the digital as an inherently dynamic and potentially uncommodifiable mode of production and artistic expression."
}
